code/test.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/accesscontrol/wsdl">
   <soap:Header>
   <soap:Body>
      <wsdl:GetAreaInfoList>
         <!--Optional:-->
         <!--type: int-->
         <wsdl:Limit>6=LM3DC4Uqv7`.jn%@>Ier3;&i;r|E[0hF$r*T8h}RvHvTAwL</wsdl:Limit>
         <!--Optional:-->
         <!--type: string-->
         <wsdl:StartReference>^rysYB5,\xr_&_e~n&'+t)k4M7z;xnQ]mGzUp6L=Q&</wsdl:StartReference>
      </wsdl:GetAreaInfoList>
   </soap:Body>
</soap:Envelope>


onvif , soap의 규격에 안맞는 패킷 보내기

1.soap에 태그중에 하나를 랜덤하게 고른뒤 랜덤하게 태그를 바꿔보기 
2.soap에 태그중에 하나를 랜덤하게 고른뒤 태그를 없애보기
4.태그를 랜덤한 위치로 이동

3.정말 랜덤한 위치부터 랜덤한 길이로 랜덤한 문자열 보내보기


soap 파싱하기
DB에서 값 꺼내기 -> 상위 5개면 다양성이 떨어질듯

soap 파싱 하는 방법은
/를 데이터값 보내기 전에 파싱을 해둔다.
파싱한 /뒤에 >까지 리스트에 저장
옵션이 있는 경우를 대비해서 : 와 공백을 기준으로 데이터를 뽑는다.